04_crime_data_analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-06 mer. 16:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fourth course: Crime data analysis</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Fourth course: Crime data analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc839b30">1. Get the data [10 min]</a>
<ul>
<li><a href="#org6418a92">1.1. Forseeable problems</a></li>
</ul>
</li>
<li><a href="#org288b6ad">2. Get a feel for the dataset by looking at each column in isolation [1 h]</a>
<ul>
<li><a href="#org03bae9e">2.1. Hints</a></li>
</ul>
</li>
<li><a href="#org453b57b">3. Understand what tidy data looks like [1 h]</a>
<ul>
<li><a href="#org1eb2103">3.1. Hints</a></li>
</ul>
</li>
<li><a href="#orgea3b12d">4. Look for binary relationships in the dataset [20 min]</a>
<ul>
<li><a href="#orgb89fc1c">4.1. Hints</a></li>
</ul>
</li>
<li><a href="#org8dcb0e8">5. Try to predict the outcome variable [Homework]</a>
<ul>
<li><a href="#orgab77492">5.1. Hints</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The goal of this session is to make you understand, clean up and analyze an unknown dataset.
</p>

<p>
Within the 3 hours, you should be able:
</p>
<ul class="org-ul">
<li>to identify which columns in the dataset is the <i>outcome variable</i>, the one we wish to predict</li>
<li>to predict it with reasonable accuracy using a reasonable selection of the other columns, the <i>predictors</i></li>
<li>to have an opinion on the usefulness and applicability of what you did.</li>
</ul>

<div id="outline-container-orgc839b30" class="outline-2">
<h2 id="orgc839b30"><span class="section-number-2">1</span> Get the data [10 min]</h2>
<div class="outline-text-2" id="text-1">
<p>
First, download the csv data file fome <a href="crime_data_sample.csv">here</a> and save it in a sensible place on your drive.
</p>

<p>
Then, open a Python notebook, either through <code>jupyter notebook</code> or <code>jupyter lab</code>, and load the downloaded csv file using <a href="https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html">pandas</a>.
</p>

<p>
So far, this is the same thing we did last session.
</p>
</div>
<div id="outline-container-org6418a92" class="outline-3">
<h3 id="org6418a92"><span class="section-number-3">1.1</span> Forseeable problems</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>I'm not able to open a Python Notebook</dt><dd>Refer to the previous 2 courses. On Windows, search for Anaconda GUI and click on "Jupyter Lab", or launch a command window and type <code>jupyter lab</code>. On Mac, type <code>jupyter lab</code> in a Terminal.app window. Take notes on how it works on your computer.</dd>
<dt>FileNotFound error</dt><dd>The cleanest solution is to keep your data file and your notebook in the same folder.
<ul class="org-ul">
<li><a href="http://www.harperdoit.net/dlo/DLOwebsite/csfiles/WindowsVistaFilesandFoldersTutorial.pdf">Here</a> is a handy guide on files and folder for Windows ;</li>
<li><a href="https://support.apple.com/guide/mac-help/organize-files-using-folders-mh26885/mac">here</a> and <a href="https://support.apple.com/guide/mac-help/finder-mchlp2605/mac">here</a> are two guides for mac users.</li>
</ul></dd>
<dt>I don't know how to load a file using pandas</dt><dd>Read the linked "10 minutes to pandas" tutorial, use the search function of your web browser (ctrl-F) to look for something related to "csv".</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org288b6ad" class="outline-2">
<h2 id="org288b6ad"><span class="section-number-2">2</span> Get a feel for the dataset by looking at each column in isolation [1 h]</h2>
<div class="outline-text-2" id="text-2">
<p>
For each column in the dataset:
</p>
<ul class="org-ul">
<li>roughly manually translate the header in english. Don't sweat it, this is just to get a vague understanding of what the data is about. [2 min]</li>
<li>In a notebook cell, write a snippet to show the list of possible values each column can take [30 min].</li>
<li>roughly manually translate the possible values of the columns that seem the most interesting, get a feel for what they roughly mean. [5 min]</li>
<li>understand, for the most important columns, the type of variable you are dealing with: [10 min]
<ul class="org-ul">
<li>discrete</li>
<li>continuous</li>
<li>categorical</li>
</ul></li>
<li>for the 4 to 10 columns you deem the most interesting, use the appropriate type of graph to draw their distribution. [10 min]</li>
</ul>


<p>
Identify the <i>outcome variable</i> and select a reasonable set of <i>predictor variables</i>. [3 min]
</p>
</div>
<div id="outline-container-org03bae9e" class="outline-3">
<h3 id="org03bae9e"><span class="section-number-3">2.1</span> Hints</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://docs.python.org/3/tutorial/datastructures.html">https://docs.python.org/3/tutorial/datastructures.html</a></li>
<li><a href="https://towardsdatascience.com/data-types-in-statistics-347e152e8bee">https://towardsdatascience.com/data-types-in-statistics-347e152e8bee</a></li>
<li><a href="https://seaborn.pydata.org/tutorial/distributions.html">https://seaborn.pydata.org/tutorial/distributions.html</a></li>
<li><a href="https://seaborn.pydata.org/tutorial/categorical.html">https://seaborn.pydata.org/tutorial/categorical.html</a></li>
<li><a href="https://seaborn.pydata.org/generated/seaborn.countplot.html">https://seaborn.pydata.org/generated/seaborn.countplot.html</a></li>
<li><a href="https://seaborn.pydata.org/generated/seaborn.distplot.html">https://seaborn.pydata.org/generated/seaborn.distplot.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org453b57b" class="outline-2">
<h2 id="org453b57b"><span class="section-number-2">3</span> Understand what tidy data looks like [1 h]</h2>
<div class="outline-text-2" id="text-3">
<p>
Skim the <a href="https://www.jstatsoft.org/index.php/jss/article/view/v059i10/v59i10.pdf">"Tidy Data" paper</a>, look mainly at the examples. [5 min]
</p>

<p>
Look at the provided crime data sample file.
</p>

<p>
What are the most "untidy" columns ? [5 min]
</p>

<p>
What can you do to make them tidy ?
</p>

<p>
Do it. [40 min]
</p>

<p>
Restrict your dataset to the outcome variable and the tidied up reasonable set of predictors. [10 min]
</p>
</div>

<div id="outline-container-org1eb2103" class="outline-3">
<h3 id="org1eb2103"><span class="section-number-3">3.1</span> Hints</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Two different columns sharing a possible value is the smell of untidyness</li>
<li><a href="https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OneHotEncoder.html">https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OneHotEncoder.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgea3b12d" class="outline-2">
<h2 id="orgea3b12d"><span class="section-number-2">4</span> Look for binary relationships in the dataset [20 min]</h2>
<div class="outline-text-2" id="text-4">
<p>
The columns are not independent. Look for the strongest relationships in the dataset.
</p>

<p>
If two predictors are very closely linked, what should you do, or at least what should you be mindful of ?
</p>

<p>
Do you see any strong link between a predictor and the outcome variable ?
</p>
</div>
<div id="outline-container-orgb89fc1c" class="outline-3">
<h3 id="orgb89fc1c"><span class="section-number-3">4.1</span> Hints</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://seaborn.pydata.org/tutorial/distributions.html#visualizing-pairwise-relationships-in-a-dataset">https://seaborn.pydata.org/tutorial/distributions.html#visualizing-pairwise-relationships-in-a-dataset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8dcb0e8" class="outline-2">
<h2 id="org8dcb0e8"><span class="section-number-2">5</span> Try to predict the outcome variable [Homework]</h2>
<div class="outline-text-2" id="text-5">
<p>
Before you begin, make a convincing business case for the implementation of such a predicting machine (5 lines). Identify the major possible benefits and at least one possible risk.
</p>

<p>
How would you feel as a citizen if this predicting machine was actually being put in use ?
</p>

<p>
Now, try to predict the outcome variable from your reasonable set of predictors. Your reasonable set of predictors ought to make sense with respect to your business case.
</p>
</div>
<div id="outline-container-orgab77492" class="outline-3">
<h3 id="orgab77492"><span class="section-number-3">5.1</span> Hints</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://scikit-learn.org/stable/tutorial/machine_learning_map/index.html">https://scikit-learn.org/stable/tutorial/machine_learning_map/index.html</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-11-06 mer. 16:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
